package Sorting;
/*
* 排序：
* 内部排序和外部排序
* 一类是整个排序过程再内存储器中进行称为内部排序
* 另一类是由于待排序的元素数量太大，以至于内存储器无法容纳全部数据，排序需要借助外部存储设配才能完成称为外部排序
*
* 稳定排序和不稳定排序针对于相同大小的数（带标签的）
*
*比较排序和非比较排序：
* 大部分排序都是需要通过比较首先来判断大小，作为排序的依据
* 但是也有例外 比如基数排序，计数排序不需要进行比较
*
*插入排序（直接插入排序，希尔排序，折半插入排序）：把无序子序列中的一个或几个记录插入到有序的序列中 从而增加记录的有序子序列长度
* 交换排序（冒泡排序，快速排序）：通过，交换无序序列中的记录从而得到其中关键字最小或最大的记录，并把它们加入到有序的子序列中，以此方法增加记录的有序子序列长度
* 选择排序（选择排序，堆排序）：从记录的无序子序列中选择关键字最小或最大的记录，并把它加入到有序子序列中，以此方法增加记录的有序子序列的长度
* 归并排序：通过归并两个或两个以上的记录有序子序列，逐步增加记录有序序列的长度
*
*
* */
public class SortinggReview {


}
